In [2]:
import pandas as pd

In [3]:
data = {'2020' : [9668465, 3391946, 2942828, 1450062],
        '2010' : [10312545, 3567910, 2758296, 1454636]}
df = pd.DataFrame(data)
df

      2020      2010
0  9668465  10312545
1  3391946   3567910
2  2942828   2758296
3  1450062   1454636

## 1.인덱스 설정
    1-1. 데이터의 인덱스가 '기본'인 경우 '원하는 인덱스'로 변경  
    - 데이터프레임_변수명.index = [원하는 인덱스(행의 수 동일하게)]  
---
    1-2. 데이터의 인덱스를 '설정'하여 데이터프레임 만들기
    - df = pd.DataFrame(data, index = [원하는 인덱스(행의 수 동일하게)])

In [5]:
df.index = ["서울", "부산", "인천" , "광주",]
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [52]:
# df = pd.DataFrame(score, index = ["서울", "부산", "인천" , "광주"])
# df

## 2.인덱스 지정하여 생성(리스트 구조 활용)
    - 데이터의 형태를 리스트로 설정하여 DataFrame에 각각 넣기
    - df2 = pd.DataFrame(데이터_리스트, index = 인덱스_리스트, columns=header_리스트)

In [53]:
data2 = [[9668465, 3391946, 2942828, 1450062],
        [10312545, 3567910, 2758296, 1454636]]
ind = [ '2020','2010']
col = ["서울", "부산", "인천" , "광주"]
df2 = pd.DataFrame(data2, index = ind, columns=col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

## 3.데이터프레임 전치(transpose)
    - 데이터프레임_변수명.T

In [54]:
df2.T

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

## 4.Values, Index, Columns 확인하기

In [55]:
print(f"""
데이터프레임의 값 확인
{df.values}

데이터프레임의 인덱스 확인
{df.index}

데이터프레임의 컬럼 확인
{df.columns}""")

데이터프레임의 값 확인
[[ 9668465 10312545]
 [ 3391946  3567910]
 [ 2942828  2758296]
 [ 1450062  1454636]]

데이터프레임의 인덱스 확인
Index(['서울', '부산', '인천', '광주'], dtype='object')

데이터프레임의 컬럼 확인
Index(['2020', '2010'], dtype='object')

## 5.열 인덱싱 - 키값(Header)를 아는 경우
    - df["키값1", "키값2", ··· ] : 데이터프레임 형태X
    - df[["키값1", "키값2", ··· ]] : 데이터프레임 형태O

In [56]:
# 열 인덱스 확인하기(열 인덱싱)
df[["2020", "2010"]]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

## 6.데이터 추가하기
    - df["지정할_Key"] = [데이터, 데이터, 데이터, ···]

In [57]:
# 열 추가하기
df["2005"] = [9762546, 3512547, 2517680, 2437829]
df

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680
광주  1450062   1454636  2437829

## 7.행 슬라이싱
    - df["인덱스명_1" : "인덱스명_2"] 
    - df[인덱스번호_1 : 인덱스번호_2]
- 인덱스 **_번호_** 또는 **_인덱스명_** 으로 슬라이싱 할 수 있다.
- **1개**의 행만 지정할 수 **없다**. (df[0] 불가)

In [58]:
#데이터프레임 '행' 슬라이싱
# df[0:2] , df["서울":"부산"]
df["서울":"부산"]
# df[0]

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

## 8. loc[]인덱서 : _인덱서의 이름_ 을 가지고 행을 가져올 때 _원하는 열도 지정_ 할 수 있음
    - df.loc[ "인덱스명_1" : "인덱스명_2" , "헤더_1" : "헤더_2" ] : DF형태로 출력
    - df.loc["인덱스명"] : DF형태가 X []한 번 더 씌워줘야 해

In [59]:
#loc[]인덱서 : 실제 '인덱스 이름'을 사용하여 행을 가지고 올 때 사용
# 일단 슬라일
# df.loc["부산":"인천", "2020":"2010"]
df.loc[['부산']]

       2020     2010     2005
부산  3391946  3567910  3512547

In [60]:
df[1:3][["2020", "2010"]]

       2020     2010
부산  3391946  3567910
인천  2942828  2758296

## 9. iloc[]인덱서 : 원하는 인덱스에 해당하는 _행의 값만_ 출력
    - df.iloc[인덱스번호] : DF형태로 출력 안됨. [] 한 번 더 씌워줘야 해.

In [61]:
#
df.iloc[[3]]

       2020     2010     2005
광주  1450062  1454636  2437829

In [62]:
aa = df[["2010"]] > 2500000
aa

     2010
서울   True
부산   True
인천   True
광주  False

In [63]:
df["2010"] > 2500000

서울     True
부산     True
인천     True
광주    False
Name: 2010, dtype: bool

In [64]:
df[aa]

    2020        2010  2005
서울   NaN  10312545.0   NaN
부산   NaN   3567910.0   NaN
인천   NaN   2758296.0   NaN
광주   NaN         NaN   NaN

In [65]:
df[df["2010"] > 2500000]

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680

In [66]:
df[aa].notnull()

     2020   2010   2005
서울  False   True  False
부산  False   True  False
인천  False   True  False
광주  False  False  False

## 10.CSV파일 불러오기
    - population = pd.read_csv("population.csv", encoding = "EUC-KR", index_col = 원하는 헤드값)

In [67]:
population = pd.read_csv("population.csv", encoding = "EUC-KR")
population

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

## 11.파일의 인코딩 확인하는 방법

In [68]:
import chardet
rawdata = open("population.csv", 'rb').read()
result = chardet.detect(rawdata)
charenc = result['encoding']
charenc

'EUC-KR'

## 12.인덱스 변경하기 
    - DF변수.set_index("원하는 헤더값", inplace = True)
    - inplace = True 는 원본값을 대체한다는 의미

In [69]:
population.set_index("도시", inplace=True)
population

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

## 13.오름차순과 내림차순 정렬 : Series.sort_value(ascending = )
    - DF변수명.sort_values() : 오름차순
    - DF변수명.sort_values(ascending = False) : 내림차순

In [70]:
#오름차순
population["2010"].sort_values()

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [71]:
#내림차순
population["2010"].sort_values(ascending = False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

### 13-1.데이터 정렬

In [72]:
#1. DF을 2010년 인구수 기준으로 정렬해라
population.sort_values(by="2010")

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

### 13-2.지역과 2010년 인구수 기준으로 정렬해라

In [73]:
population.sort_values(by=["지역", "2010"])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

# Score

#### Score.csv

In [74]:
import chardet
rawdata = open("score.csv", 'rb').read()
result = chardet.detect(rawdata)
charenc = result['encoding']
charenc

'EUC-KR'

In [75]:
score = pd.read_csv("score.csv", encoding = "EUC-KR", index_col="과목")
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

## 1.학급별 총계(열기준 : axis = 0, 행기준 : axis = 1)
- 0은 열을 기준으로 더 해줘 / 열을 모두 더하렴

In [76]:
# 학급별 총계
#0은 열을 기준으로 더 해줘 / 열을 모두 더하렴
score.sum(axis=0)

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [77]:
#과목별 합계를 데이터 프레임에 추가학
score["합계"] = score.sum(axis=1)
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [78]:
# 과목별 평균을 계산해서 column을 추가해라
score["평균"] = score.loc[:, :"4반"].mean(axis = 1)
#행은 전체를 가져오고 열은 0열부터 4반까지의 열만 가져와
#이들의 평균을 구하는데, 행을 기준으로 구해줘
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [79]:
#max(), min()
print(f"""
score.min() : 열(반) 기준
{score.min()}

score.min(axis = 1) : 행(과목별)기준
{score.min(axis = 1)}
""")

score.min() : 열(반) 기준
1반     11.00
2반     44.00
3반     45.00
4반     26.00
합계    163.00
평균     40.75
dtype: float64

score.min(axis = 1) : 행(과목별)기준
과목
파이썬    39.0
DB     45.0
자바     45.0
크롤링    40.0
Web    11.0
dtype: float64

In [80]:
#max(), min()
print(f"""
score.max() : 열(반) 기준
{score.max()}

score.max(axis = 1) : 행(과목별)기준
{score.max(axis = 1)}
""")

score.max() : 열(반) 기준
1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

score.max(axis = 1) : 행(과목별)기준
과목
파이썬    201.0
DB     282.0
자바     253.0
크롤링    298.0
Web    163.0
dtype: float64

In [81]:
# 전체 반에서 과목별로 제일 높은 점수
max_sc = score.loc[:, :"4반"].max(axis = 1)
pd.DataFrame(max_sc)

      0
과목
파이썬  73
DB   92
자바   92
크롤링  92
Web  79

In [82]:
# 전체 반에서 과목별로 제일 낮은 점수
min_sc = score.loc[:, :"4반"].min(axis = 1)
pd.DataFrame(min_sc)

      0
과목
파이썬  39
DB   45
자바   45
크롤링  40
Web  11

In [83]:
pd.DataFrame(max_sc - min_sc)

      0
과목
파이썬  34
DB   47
자바   47
크롤링  52
Web  68

In [84]:
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [85]:
score = score.drop(["Web"], axis=0)
# sc_df = pd.DataFrame(score)

In [86]:


df100 = score.apply
df100

<bound method DataFrame.apply of      1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50>

In [87]:



# score = score.drop(["평균"], axis=1)
# score = del score["합계"]
# score

## 2.행이나 열단위로 복잡한 처리를 사용하고 싶을 때 : df.apply(func, axis = 0 or 1)

In [88]:
data_dic = {"A" : [1,2,3,4,4], 
            "B" : [1,2,2,3,3],
            "C" : [1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  2  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [89]:
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  1.0  2.0  1.0
3  1.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [90]:
df4.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  1.0  2.0  1.0
3  1.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 3.카테고리 생성

In [91]:
ages = [0,2,10,21,23,37,31,61,20,41,32,100]
bins = [0,15,25,35,60,99] #구간 시작점은 1 작게 설정
labels = ["미성년자", "청년", '중년', '장년', '노년']
age_cat = pd.cut(ages, bins, labels=labels)
age_cat
# cats_pd = pd.DataFrame(age_cat)
# cats_pd

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [92]:
type(age_cat)

pandas.core.arrays.categorical.Categorical

In [94]:
age_cat.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

### 3-1.ages 데이터 프레임으로 만들기
---
데이터 프레임의 colum명 설정할 때 : columns=["ages"]

In [95]:
ageArr = pd.DataFrame(ages, columns=["ages"])
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [96]:
#열 추가하기
ageArr['age_cat'] = age_cat
ageArr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

### 3-2.카테고리별로 나이 개수 확인하기

In [98]:


x = ageArr[["age_cat"]]
x.apply(pd.value_counts, axis = 0)

# ageArr["age_cat"].value_counts()

      age_cat
청년          3
미성년자        2
중년          2
장년          2
노년          1

In [99]:
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50

In [100]:
def find_min(score):
    min_result = score.min(axis=1)
    return min_result

min_df = pd.DataFrame(score.apply(min, axis=0))
min_df

         0
1반   45.00
2반   44.00
3반   45.00
4반   39.00
합계  201.00
평균   50.25

## 4.데이터 병합

### 4-1. merge(원하는 시리즈나 데이터프레임) 
- <u>**공통 컬럼**</u> 이 존재해야 함.
- 그 공통 컬럼을 기준으로 병합함

In [4]:
import pandas as pd

employee = [{'empno':1, 'ename':'kim', 'dept':1},
            {'empno':2, 'ename':'lee', 'dept':2},
            {'empno':3, 'ename':'park', 'dept':1},
            {'empno':4, 'ename':'song', 'dept':3},
            {'empno':5, 'ename':'min', 'dept':2}
           ]
dept=[{'dept':1, 'deptname':'관리직'},
      {'dept':2, 'deptname':'영업직'},
      {'dept':3, 'deptname':'개발직'}
     ]
info =[{'empno':1, 'addr':'서울시','phone':'010-1111-1111'},
       {'empno':3, 'addr':'부산시','phone':'010-2222-2222'},
       {'empno':2, 'addr':'광주시','phone':'010-3333-3333'},
       {'empno':5, 'addr':'광주시','phone':'010-4444-4444'},
       {'empno':4, 'addr':'광주시','phone':'010-5555-5555'}
      ]

emp = pd.DataFrame(employee)
dept = pd.DataFrame(dept)
info = pd.DataFrame(info)

In [13]:
print(emp)
print(dept)
pd.merge(emp, dept, on = "dept")
# pd.merge(dept, emp, on = "dept")

   empno ename  dept
0      1   kim     1
1      2   lee     2
2      3  park     1
3      4  song     3
4      5   min     2
   dept deptname
0     1      관리직
1     2      영업직
2     3      개발직

   empno ename  dept deptname
0      1   kim     1      관리직
1      3  park     1      관리직
2      2   lee     2      영업직
3      5   min     2      영업직
4      4  song     3      개발직

In [14]:
print(emp)
print(dept)
mg = pd.merge(emp, dept, on = "dept")
mg.drop(columns = ["dept"], inplace=True)
mg

   empno ename  dept
0      1   kim     1
1      2   lee     2
2      3  park     1
3      4  song     3
4      5   min     2
   dept deptname
0     1      관리직
1     2      영업직
2     3      개발직

   empno ename deptname
0      1   kim      관리직
1      3  park      관리직
2      2   lee      영업직
3      5   min      영업직
4      4  song      개발직

In [16]:
print(pd.concat([emp, dept]))
print(pd.merge(emp, dept, on = "dept"))

   empno ename  dept deptname
0    1.0   kim     1      NaN
1    2.0   lee     2      NaN
2    3.0  park     1      NaN
3    4.0  song     3      NaN
4    5.0   min     2      NaN
0    NaN   NaN     1      관리직
1    NaN   NaN     2      영업직
2    NaN   NaN     3      개발직
   empno ename  dept deptname
0      1   kim     1      관리직
1      3  park     1      관리직
2      2   lee     2      영업직
3      5   min     2      영업직
4      4  song     3      개발직

In [21]:
print(pd.concat([emp, dept], axis = 1))
print(pd.merge(emp, dept, on = "dept"))

   empno ename  dept  dept deptname
0      1   kim     1   1.0      관리직
1      2   lee     2   2.0      영업직
2      3  park     1   3.0      개발직
3      4  song     3   NaN      NaN
4      5   min     2   NaN      NaN
   empno ename  dept deptname
0      1   kim     1      관리직
1      3  park     1      관리직
2      2   lee     2      영업직
3      5   min     2      영업직
4      4  song     3      개발직

### 4-2. concat([원하는 series 또는 DF])
- 일단 합치고 싶고 데이터에 대해 모를 때 사용

In [101]:
df1 = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3'],
                    'C' : ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']},
                   index = [0,1,2,3])

df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                    'D' : ['D4', 'D5', 'D6', 'D7']},
                   index=[4,5,6,7])

df3 = pd.DataFrame({"A" : ["A8", "A9", "A10", "A11"],
                    "B" : ["B8", "B9", "B10", "B11"],
                    "C" : ["C8", "C9", "C10", "C11"],
                    "D" : ["D8", "D9", "D10", "D11"]},
                   index = [8,9,10,11])

In [102]:
result = pd.concat([df1, df2, df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

##### Keys속성 부여 시 다중 index가 된다

In [103]:
result_2 = pd.concat([df1, df2, df3], keys = ["x", "y", "z"])
result_2

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

##### 다중 인덱스 확인
- 전체를 확인할 때 : **index**
- 다중인덱스에서 원하는 열을 확인하고 싶을 때,  
   **index.get_level_values(열번호)**

In [104]:
result_2.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [105]:
print(f"""{result_2.index.get_level_values(0)}
{result_2.index.get_level_values(1)}""")

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')
Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [106]:
df4 = pd.DataFrame({"B" : ["B2", "B3", "B6", "B7"],
                    "D" : ["D2", "D3", "D6", "D7"],
                    "F" : ["F2", "F3", "F6", "F7"]},
                   index = [2,3,6,7])

### 4-3.행기준 병합과 열기준 병합 비교

In [117]:
result_d1_1 = pd.concat([df1, df4], axis=1)
result_d1_0 = pd.concat([df1, df4])
result_d1_1
# result_d1_0

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [108]:
result_col = pd.concat([df1, df2, df3])
result_row = pd.concat([df1, df2, df3], axis=1)
print(result_col) #열이 겹치는 걸 합쳐줌
print(result_row) #행이 겹치는 걸 합쳐줌

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### 4-4.concat함수의 join속성

In [109]:
result_join = pd.concat([df1, df4], axis=1, join='inner')
result_join

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [113]:
print(df1)
print(df4)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [110]:
result_join = pd.concat([df1, df4], axis=0, join='inner')
result_join

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

### 4-5.concat함수의 ignore_index 속성
- <U>__기존 인덱스__</U> 를 <U>__무시__</U> 하고 새로운 인덱스 부여하는 기능

In [125]:
result_ignore_index = pd.concat([df1, df4], ignore_index=True)
print(result_ignore_index, "\n\n", result_d1_0, "\n\n", result_d1_1)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

      A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

      A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [127]:
result_ignore_index_1 = pd.concat([df1, df4], axis =1, ignore_index=True)

print( result_d1_1, "\n\n", result_ignore_index_1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

      0    1    2    3    4    5    6
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7